import { MethodItem, MethodList, UkrPostLogo } from './DeliveryMethodStyled';
import NovaSvg from '../../assets/novaPoshta.svg?react';

const DeliveryMethod = () => {
  return (
    <MethodList>
      <MethodItem>
        <NovaSvg />
        <div>
          <h4>Доставка Новою Поштою</h4>
          <p>
            У середньому, доставка займає 1-2 дні. За потреби наші менеджери
            можуть повідомити точну дату й вартість доставки. Замовлення
            необхідно оплатити до його відправлення. Даний спосіб доставки
            підійде для людей, які хочуть якнайшвидше отримати своє замовлення.
          </p>
        </div>
      </MethodItem>

      <MethodItem>
        <NovaSvg />
        <div>
          <h4>Доставка Новою Поштою з оплатою при отриманні</h4>
          <p>
            У середньому доставка займає 1-2 дні. Вартість доставки з оплатою
            замовлення при отриманні становить від 75 грн. Даний спосіб доставки
            підійде для людей, які хочуть якнайшвидше отримати своє замовлення і
            оплатити його у відділенні Нової Пошти.
          </p>
        </div>
      </MethodItem>

      <MethodItem>
        <UkrPostLogo />
        <div>
          <h4>Доставка Укрпоштою Експрес</h4>
          <p>
            Ми пропонуємо безкоштовну експрес-доставку для замовлень від 750 грн
            до відділення Укрпошти впродовж 2-4 днів з моменту оформлення
            замовлення. Даний спосіб доставки підійде для людей, які хочуть
            заощадити та можуть оплатити замовлення до його відправлення.
            Укрпоштою надсилаються товари завдовжки до 70 см.
          </p>
        </div>
      </MethodItem>

      <MethodItem>
        <UkrPostLogo />
        <div>
          <h4>Доставка Укрпоштою Експрес з оплатою при отриманні</h4>
          <p>
            У середньому доставка займає 2-4 дні. Вартість доставки з оплатою
            замовлення при отриманні становить 50 грн. Цей спосіб доставки
            підійде для людей, які хочуть заощадити, але не бажають оплачувати
            замовлення до отримання.
          </p>
        </div>
      </MethodItem>
    </MethodList>
  );
};

export default DeliveryMethod;
